Revit 2024 API
FilterDialog Methods
The FilterDialog type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Show
 Shows the FilterDialog editing dialog to the user.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FilterDialog Class
Autodesk.Revit.UI Namespace